Repository: common-repository/kau-boys-autocompleter
Catalog: autocompleter-*.po
Languages: de_de

source: Integrates a google suggest like search to your blog. It Prototype (Scriptaculous) or the jQuery to search for text within the title and/or the content.
de_de: Integriert eine Google Suggest ähnliche Suche in Ihren Blog. Es Prototype (Scriptaculous) oder die jQuery für die Suche nach Text innerhalb des Titels und / oder den Inhalt.

source: Here you can customize the plugin for your needs.
de_de: Hier können Sie das Plugin an Ihre eigenen Bedürfnisse anpassen.

source: Here you can choose the JavaScript framework you prefer.
de_de: Hier können Sie Ihr bevorzugtes JavaScript Framework auswählen.

source: Selectortype
de_de: Selektortype

source: Here you can set if you select the input by the id or name attribute (default = id).
de_de: Hier können Sie ob sie das Suchfeld per id oder name Attribut auswählen (Standard = id)

source: Search field attribute value
de_de: Suchfeld Attributwert

source: Here you can set the value of the id or name attribute from the search input used in your template (default = s).
de_de: Hier können Sie den Wert des id oder name Attributs eingeben, dass Sie in ihrem Tempalte verwenden (Standard = s)

source: Number of results
de_de: Anzahl der Ergebnisse

source: Here you can set the number of posts that will be shown.
de_de: Hier können Sie einstellen, wie viele Ergebnisse maximal angezeigt werden sollen.

source: Searchfields
de_de: Suchfelder

source: Title only
de_de: Nur Titel

source: Content only
de_de: Nur Inhalt

source: Title and Content
de_de: Titel und Inhalt

source: Here you can set where to search for the searchterm.
de_de: Hier können Sie einstellen, wo nach dem Suchbegriff gesucht werden soll.

source: Resultfields
de_de: Ergebnisfelder

source: Here you can set which fields to show in the results list.
de_de: Hier können Sie einstellen, welche Felder im Suchergebnis angezeigt werden sollen.

source: Title length
de_de: Titellänge

source: Here you can set the maximum length of the title in the results (default = 50).
de_de: Hier können Sie die maximale Länge des Titel in den Ergebnissen festlegen (Standard = 50).

source: Content length
de_de: Inhaltslänge

source: Here you can set the maximum length of the content in the results (default = 120).
de_de: Hier können Sie die maximale Länge des Inhalts in den Ergebnissen festlegen (Standard = 120).

source: Multibyte encoding
de_de: Multibyte Kodierung

source: Here you can set the encoding for the multibyte functions (default = UTF-8).
de_de: Hier können Sie die Kodierung für die Multibyte Funktionen einstellen (Standard = UTF-8).

source: Path to custom css
de_de: Pfad zu eigener CSS-Datei

source: Here you can set the path to a custom css file.
de_de: Hier können Sie den Pfad zu einer eigenen CSS-Datei einstellen.

source: Just use the <a href="%1$sautocompleter.css">autocompleter.css</a> from the plugin folder as an example to create your own stylessheets. You should use an absolute path (e.g. http://example.com/mystyles.css).
de_de: Nehmen Sie als Vorlage einfach die <a href="%1$sautocompleter.css">autocompleter.css</a> aus dem Plugin-Verzeichnis. Sie sollten eine absolute Pfadangabe verwenden (z.B. http://beispiel.de/meinestyles.css).

source: Kau-Boy's AutoCompleter <b>is deprecated and will be removed</b> from the plugin directory on <b>June 19, 2023</b>, 14 years after its first release. Thanks to everyone who used the plugin, gave constructive feedback, rated it and send me messages on how it helped them with their sites. This was <a href="https://kau-boys.de/19/allgemein/mein-erster-blog">my very first WordPress plugin, and it started my journey into the WordPress community</a>. If you see this message, you are one of few, who still have this plugin installed. But now feel free to remove it from your site. If you still want an auto-completion/suggestion, try out <a href="https://wordpress.org/plugins/wp-search-suggest/">WP Search Suggest</a>, which is still actively maintained. You can find my other plugins <a href="https://profiles.wordpress.org/kau-boy/#content-plugins">on my WordPress profile page</a>.
de_de: Kau-Boy's AutoCompleter <b>ist veraltet und wird</b> am <b>19. Juni 2023</b>, 14 Jahre nach seiner ersten Veröffentlichung, <b>aus dem Plugin-Verzeichnis entfernt</b>. Danke an alle, die das Plugin verwendet, konstruktives Feedback gegeben, es bewertet und mir Nachrichten geschickt haben, wie es ihnen bei ihren Websites geholfen hat. Dies war <a href="https://kau-boys.de/19/allgemein/mein-erster-blog">mein allererstes WordPress-Plugin, und damit begann meine Reise in die WordPress-Community</a>. Wenn du diese Nachricht siehst, bist du einer der wenigen, die dieses Plugin noch installiert haben. Aber jetzt kannst du es gerne von deiner Website entfernen. Wenn du immer noch eine Autovervollständigung/Vorschläge wünschst, probiere <a href="https://wordpress.org/plugins/wp-search-suggest/">WP Search Suggest</a> aus, das immer noch aktiv gepflegt wird. Du kannst meine anderen Plugins <a href="https://profiles.wordpress.org/kau-boy/#content-plugins">auf meiner WordPress-Profilseite</a> finden.
